app/controllers/create_rate_controller.rb

SELECT  1 AS one FROM "users" WHERE "users"."ide" = ? LIMIT ?  [["ide", "admin100"], ["LIMIT", 1]]
SELECT  "ratings".* FROM "ratings" WHERE "ratings"."ide" = ? AND "ratings"."year" = ? AND "ratings"."month" = ? AND "ratings"."day" = ? LIMIT ?  [["ide", "admin100"], ["year", 2019], ["month", 7], ["day", 15], ["LIMIT", 1]]
SELECT  1 AS one FROM "ratings" WHERE "ratings"."ide" = ? AND "ratings"."month" = ? AND "ratings"."year" = ? AND "ratings"."day" = ? LIMIT ?  [["ide", "admin100"], ["month", 7], ["year", 2019], ["day", 15], ["LIMIT", 1]]
UPDATE "ratings" SET "what_you_bad" = ?, "what_you_do" = ?, "what_you_good" = ?, "importance" = ?, "updated_at" = ? WHERE "ratings"."id" = ?  [["what_you_bad", "qs"], ["what_you_do", "as"], ["what_you_good", "s"], ["importance", 4], ["updated_at", "2019-07-15 11:12:51.958898"], ["id", 1]]
INSERT INTO "ratings" ("what_you_do", "what_you_good", "what_you_bad", "importance", "ide", "year", "month", "day", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def get_rate
        if(User.exists?(ide: params[:id]))
            if(params[:what_you_do] == "" ||params[:what_you_good] == ""||params[:what_you_bad] == "" )
                head :bad_request
            if(params[:month].to_i>12 || params[:month].to_i < 0 || params[:day].to_i > 31 || params[:day].to_i < 0 || params[:year].to_i < 0)
                head :bad_request
            else
                if(Rating.exists?(ide: params[:id], month:  params[:month].to_i, year: params[:year].to_i , day: params[:day]) )
                    rate = Rating.find_by(ide: params[:id],year: params[:year].to_i,month: params[:month].to_i,day: params[:day].to_i)
                    rate.what_you_bad = params[:what_you_bad]
                    rate.what_you_do = params[:what_you_do]
                    rate.what_you_good = params[:what_you_good]
                    rate.importance = params[:importance].to_f
                    rate.save
                    head :ok

                else
                    Rating.create(ide: params[:id], what_you_bad: params[:what_you_bad],what_you_do: params[:what_you_do],what_you_good: params[:what_you_good],year: params[:year].to_i,month: params[:month].to_i,day: params[:day].to_i,importance: params[:importance].to_f)
                head :ok
                end
            end
        elsif(!(User.exists?(ide: params[:id])))

SELECT  1 AS one FROM "users" WHERE "users"."ide" = ? LIMIT ?  [["ide", "admin100"], ["LIMIT", 1]]
SELECT  "ratings".* FROM "ratings" WHERE "ratings"."ide" = ? AND "ratings"."year" = ? AND "ratings"."month" = ? AND "ratings"."day" = ? LIMIT ?  [["ide", "admin100"], ["year", 2019], ["month", 7], ["day", 15], ["LIMIT", 1]]
SELECT  1 AS one FROM "ratings" WHERE "ratings"."ide" = ? AND "ratings"."year" = ? AND "ratings"."month" = ? AND "ratings"."day" = ? LIMIT ?  [["ide", "admin100"], ["year", 2019], ["month", 7], ["day", 16], ["LIMIT", 1]]
---
    def send_rate
        if(User.exists?(ide: params[:id]))
            if(Rating.exists?(ide: params[:id],year: params[:year].to_i,month: params[:month].to_i,day: params[:day].to_i))
                    rate = Rating.find_by(ide: params[:id],year: params[:year].to_i,month: params[:month].to_i,day: params[:day].to_i)