app/controllers/register_controller.rb

SELECT  1 AS one FROM "users" WHERE "users"."ide" = ? LIMIT ?  [["ide", "admin100"], ["LIMIT", 1]]
INSERT INTO "users" ("ide", "password", "hour", "min", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["ide", "admin100"], ["password", "admin100"], ["hour", 15], ["min", 5], ["created_at", "2019-07-14 06:05:45.939273"], ["updated_at", "2019-07-14 06:05:45.939273"]]
---
    def register
	if(params[:password] == "" || params[:id] == "")
	    head :bad_request
	elsif(params[:hours].to_i < 0 || params[:hours].to_i > 24 || params[:minutes].to_i < 0 || params[:minutes].to_i > 60)
	    head :bad_request
	else
	    if(User.exists?(ide: params[:id]))
               head :forbidden
            elsif(!(User.exists?(ide: params[:id])))
               User.create(ide: params[:id],password: params[:password],created_at: Time.inspect,hour: params[:hours].to_i, min: params[:minutes].to_i)

SELECT  1 AS one FROM "users" WHERE "users"."ide" = ? LIMIT ?  [["ide", "admin100"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."password" = ? LIMIT ?  [["password", "admin100"], ["LIMIT", 1]]
---
    def check
        if(User.exists?(ide: params[:id]))
            if(User.exists?(password: params[:password]))
                head :ok
            elsif(!(User.exists?(password: params[:password])))